1001 = "No rez in data fork";
1002 = "No rez in rez fork";
1003 = "No rez in any fork";
1004 = "No open permission";
1005 = "Open fork error";
1006 = "Open succeeded in read only mode";
1007 = "Open documents AppleEvent failed";
1008 = "Under version control system";
1009 = "Exception parsing template";
1010 = "No resource for type";
1011 = "No resource with name";
1012 = "Already existing ID";
1013 = "More data than expected";
1014 = "Invalid hexadecimal data";
1900 = "Import Generic error";
1901 = "Invalid OSType. A type must have 4 characters.";
1902 = "Can’t get Xml data";
1903 = "Can’t build Xml tree (invalid Xml code)";
1904 = "Can’t get top Aete node";
1905 = "Unknown Aete Resource tag";
1906 = "Unknown Aete Suite tag";
1907 = "Unknown Aete Event tag";
1908 = "Unknown Aete Parameter tag";
1909 = "Unknown Aete Class tag";
1910 = "Unknown Aete Property tag";
1911 = "Unknown Aete Element tag";
1912 = "Unknown Aete Comparison Operator tag";
1913 = "Unknown Aete Enumeration tag";
1914 = "Unknown Aete Enumerator tag";
1915 = "Unknown Aete Flags tag";
2000 = "Template error";
2001 = "Get data stream failed";
2002 = "Unrecognized tag";
2003 = "Parsing aborted";
2004 = "Value too large in bits field";
2005 = "Text overflow";
2006 = "Wrong fixed count";
2007 = "Zero list not terminated";
2008 = "Zero list ending with non null";
2009 = "List count too big";
2010 = "Expected even length string";
2011 = "Unexpected tag";
2012 = "Malformed hex value";
2013 = "Malformed date value";
2014 = "Can’t get date format";
2015 = "Parse date failed";
2016 = "Not expected size";
2017 = "Create empty new aborted";
2018 = "No case in key section";
2019 = "Malformed case section";
2020 = "Unknown key value in resource";
2021 = "Isolated CASE tag";
2022 = "Can’t find keyed section start";
2023 = "Can’t find key start for value";
2024 = "Can’t find key index";
2025 = "Can’t find key value";
2026 = "Can’t find key position";
2027 = "Unsupported resource id";
2028 = "Can’t find matching key end";
3000 = "Unknown error";
3001 = "Invalid color depth";
3002 = "Format unknown";
3003 = "Size is out of range";
3004 = "Resource may be corrupt";
3005 = "File may be corrupt";
3006 = "The bitmap editor cannot edit the selected image";
3007 = "Assertion error";
3008 = "Nil pointer error";
3009 = "Out of memory";
3010 = "Resource not found";
3011 = "Disk is full";
3012 = "File not found";
3013 = "An I/O error occurred";
3014 = "This image must be between %ld and %ld pixels";
3015 = "Can’t modify locked file";
3016 = "The font size must be between 4 and 512 pts";
3017 = "No ‘PICT’ resource on the clipboard";
